# -*- coding: utf-8 -*-
"""
Created on Thu Jan 18 23:49:01 2018

@author: Geek
"""

жижиг=" намайг пүүжээ гэдэг. "
print(жижиг.title())
том=жижиг.upper()
print(том)
том=том.lstrip()

print(том.rstrip())

тоонууд = ["тэг","нэг", "хоёр", "гурав", "дөрөв","тав","зургаа","долоо","найм","ес"]
print(тоонууд)
del тоонууд[5]
print(тоонууд)
тоонууд.insert(5,"five")
print(тоонууд)
тоонууд.sort()
print(тоонууд)

del тоонууд[0]
print(тоонууд)
тоонууд.insert(0,"тав")
print(тоонууд)

тоонууд.reverse()
print(тоонууд)
тоонууд1=[0,1,2,3,4,5,6,7,8,9]
print(sum(тоонууд1))

тоонууд1 = [тоо**2 for тоо in range(0,11)]
print(тоонууд1[-1:])