# -*- coding: utf-8 -*-
"""
Created on Fri Jan 19 11:01:47 2018

@author: Geek
"""

#########################
## Жишээ: tuple буцаах функц
#########################
def БүхэлБаҮлдэгдэл(x, y):
    бүхэл = x // y
    үлдэгдэл = x % y
    return (бүхэл, үлдэгдэл)
    
(бүхэл, үлдэгдэл) = БүхэлБаҮлдэгдэл(5,3)
print("5-г 3 хуваахад бүхэл=",бүхэл)
print("5-г 3 хуваахад үлдэгдэл=",үлдэгдэл)


def Тооц(aTuple):
    тоонууд = ()    
    үгнүүд = ()
    for t in aTuple:
        тоонууд = тоонууд + (t[0],)   
        if t[1] not in үгнүүд:   
            үгнүүд = үгнүүд + (t[1],)
    бага = min(тоонууд)
    их = max(тоонууд)
    үгнийТоо = len(үгнүүд)
    return (бага, их, үгнийТоо)
хаад = ((1162,"Чингис хаан"),
          (1186, "Өгэдэй"),
          (1206,"Гүег хаан"), 
          (1209,"Мөнх хаан"))  
(бага, их, тоо) = Тооц(хаад)
print(бага, "-с ", их, \
" он хүртэл Их монгол улсын ", тоо, " хаан төрсөн")


#########################
## Жишээ: Дараалал
#########################
L=[9,6,0,3]
print(sorted(L))
L.insert(3,5)
L.sort()
print(L)
L.reverse()
print(L)



#########################
## Жишээ: aliasing /Орчуулж чадахгүй байна. Хуурмаглах, хуурах, заагч маягийн/
#########################
цифрүүд = ['нэг', 'хоёр', 'гурав']
тоонууд =цифрүүд
тоонууд.append('дөрөв')
тоонууд.insert(4,"тав")
print(цифрүүд)
print(тоонууд)

#########################
## Жишээ: cloning /Орчуулж чадахгүй байна. Хуулах/
#########################
цифрүүд = ['нэг', 'хоёр', 'гурав']
тоонууд =цифрүүд[:]
тоонууд.append('дөрөв')
print(цифрүүд)
print(тоонууд)

#########################
## Жишээ: mutation/Эрэмбэлэх жишээ нь дээр/
#########################
нэрс = ['Бат', 'Болд', 'Цэцэг', 'Ганаа']
эрэмбэ = нэрс.sort()
print(нэрс)
print(эрэмбэ)
нэрс.reverse()
нэрс.append("Гэрлээ")
эрэмбэ1 = sorted(нэрс)
print(нэрс)
print(эрэмбэ1)


def давхУст(Д1, Д2):
    Д1_хуул = Д1[:]
    for e in Д1_хуул:
        if e in Д2:
            Д1.remove(e)

Д1 = [1, 2, 3, 4]
Д2 = [1, 2, 5, 6]
давхУст(Д1, Д2)
Д1=Д1+Д2
print(Д1)
Д1.sort();
print(Д1)


