# -*- coding: utf-8 -*-
"""
Created on Fri Jan 19 09:53:36 2018

@author: Geek

MIT Програмчлал хичээл №3
"""
    
###############################
# Жишээ: Бүхэл куб язгуур гаргах 
###############################
#тоо = 27
##тоо = 8120601
#for хариу in range(тоо+1):
#    if хариу**3 == тоо:
#        print(тоо, " гэсэн тооны төгс куб язгуур бол ", хариу)
#    

###########################
## Жишээ: Куб язгуур гаргах 
###########################
#тоо= 27
##тоо = 8120601
#for хариу in range(abs(тоо)+1):
#    if хариу**3 >= abs(тоо):
#        break
#if хариу**3 != abs(тоо):
#    print(тоо, ' гэсэн тооноос бүхэл куб язгуур гарахгүй.')
#else:
#    if тоо < 0:
#        тоо = -тоо
#    print(тоо, " гэсэн тооны төгс куб язгуур бол ", хариу)


##################################
## Жишээ: Куб язгуур гаргах арга 2
##################################
##тоо = 27
##тоо = 8120601
#тоо = 10000
#алдаа = 0.01
#хариу = 0.0
#алхам = 0.005
#давт_тоо = 0
#while abs(хариу**3 - тоо) >= алдаа and хариу <= тоо:
#    хариу += алхам
#    давт_тоо += 1
#print('Давталтын тоо =', давт_тоо)
#if abs(хариу**3 - тоо) >= алдаа:
#    print('Алдаа, ', тоо, " -с куб язгуур гарахгүй.")
#else:
#    print(тоо, " гэсэн тооны төгс куб язгуур бол ", хариу)


#################################
# Жишээ: Куб язгуур гаргах арга 3
#################################
#тоо = 27
#тоо = 8120601
тоо = 0.25
алдаа = 0.1
давт_тоо = 0
бага = 0
их = тоо
хариу = (их + бага)/2.0
while abs(хариу**3 - тоо) >= алдаа:
    if хариу**3 < тоо:
        бага = хариу
    else:
        их = хариу
    хариу = (их + бага)/2.0
    давт_тоо += 1
print('Давталтын тоо =', давт_тоо)
print(тоо, " гэсэн тооны төгс куб язгуур бол ", хариу)
   