# -*- coding: utf-8 -*-
"""
Created on Fri Jan 19 10:35:18 2018

@author: Geek
"""

#############################
## Жишээ: Тэгш сонгойг шалгах
#############################
def тэгш(тоо):
    return тоо%2

def сондгой(тоо):
    return (not тэгш(тоо))

for i in range(8):
    if тэгш(i):
        print(i, "тэгш")
    elif сондгой(i):
        print(i, "сондгой")

#########################
## Куб язгуур гаргах
#########################
def КубЯзгуурГарга(тоо, алдаа):
    алдаа = 0.1
    бага = 0
    их = тоо
    хариу = (их + бага)/2.0
    while abs(хариу**3 - тоо) >= алдаа:
        if хариу**3 < тоо:
            бага = хариу
        else:
            их = хариу
        хариу = (их + бага)/2.0
    return хариу

тоо = 1
while тоо <= 10000:
    хариу = КубЯзгуурГарга(тоо, 0.01)
    print(тоо, " гэсэн тооны төгс куб язгуур бол ", хариу)
    тоо *= 10
    
#########################
## EXAMPLE: Функц буцаах функц 
#########################
def дуудах():
    def дэд(a, b):
        return a+b
    return дэд
    
хариу = дуудах()(3,4)
print(хариу,"")
