################################################
print("Одоо console-руу хэвлэх болно.")
################################################


################################################
y = 12
print(y)
y= y*2
print(y)
################################################


################################################
x = 100
if x == 100:
    print("x бол 100-тэй тэнцүү")
else:
    print("x бол 100-с ялгаатай")
################################################


# Дасгал 
#     1. Hello world гэж хэвлэх
#     2. Өгсөн 2 тооны нийлбэр олоод хэвлэх
#     3. Өгсөн 3 тооны үржвэр 100 их бол YES үгүй бол NO гэж хэвлэх.
